
&НаКлиенте
Процедура ТестЗапрос(Команда)
	
	Соединение = Новый HTTPСоединение("192.168.0.234",48080,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	ЧтениеJSON  = Новый ЧтениеJSON;
	Запрос = Новый HTTPЗапрос("/ACC/rest/v1/cards", Заголовки);
	
	
	
	ИмяФайла = ("H:\Пашков\Задачи\Обмен с Artix\ChahgArtix\test.json");
	//D:\Пашков\Артикс
	//H:\Пашков\Задачи\Обмен с Artix\ChahgArtix
	ВыбФайл = Новый Файл(ИмяФайла);
	
	//Если ВыбФайл.Существует() Тогда //проверка на существование файла
	
	Текст = Новый ЧтениеТекста(ИмяФайла);
	
	Строка = Текст.Прочитать();
	
	
	Запрос.УстановитьТелоИзСтроки("text="+Строка);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	//В запросе можно обратиться к нужному ресурсу и с нужными параметрами
	//Запрос = Новый HTTPЗапрос("/index.php?param1=1¶m2=2"); 
	
	//Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		Сообщить(Ответ.ПолучитьТелоКакСтроку()); //получим HTML-код страницы 
	Иначе
		Сообщить("Код ответа: "+Ответ.КодСостояния); //анализируем код состояния и делаем выводы
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Добавление_В_КСНаСервере()
	
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	
	ИмяФайлаВыгрузки = "H:\Пашков\Задачи\Обмен с Artix\ChahgArtix\All.aif";              
	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	//ЗаписьJSON.ОткрытьФайл(ИмяФайлаВыгрузки);
	
	Подвал = "### data end ###";
	Шапка = "### data begin ###";
	ЗаписатьДанныеВФайл(ТекстовыйФайл,ИмяФайлаВыгрузки,Шапка);
	
	
	Разделитель = "---";
	//ЗаписатьJSON(ЗаписьJSON, Шапка, Новый НастройкиСериализацииJSON);
	ПараметрыДжсон = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	
	ЗаписатьКомманду(ТекстовыйФайл,Объект.СписокКомманд.Сертификаты,ИмяФайлаВыгрузки,ЗаписьJSON,ПараметрыДжсон,Разделитель);
	
	
	Сертификат = Новый Структура;
	
	
	
	СтркутураСертификата = Новый Структура;
	СтркутураСертификата.Вставить("code",15);
	СтркутураСертификата.Вставить("rangefrom",120);
	
	СтркутураСертификата.Вставить("rangeto",160);
	СтркутураСертификата.Вставить("name","Сертификат 1");
	СтркутураСертификата.Вставить("sum",5000);
	СтркутураСертификата.Вставить("inputmask",1);
	СтркутураСертификата.Вставить("fullyspend",1);
	СтркутураСертификата.Вставить("skiplastsymbol",1);
	СтркутураСертификата.Вставить("tmccode","94857");
	СтркутураСертификата.Вставить("minsum",2);
	СтркутураСертификата.Вставить("maxsum",1000);
	СтркутураСертификата.Вставить("multiplesum",1);
	СтркутураСертификата.Вставить("deptcode",2);
	СтркутураСертификата.Вставить("taxgroupcode",0);
	СтркутураСертификата.Вставить("vatcode",2);
	СтркутураСертификата.Вставить("paymentobject",10);
	СтркутураСертификата.Вставить("regexpattern","[0-9]");
	СтркутураСертификата.Вставить("discountcampaign","test campaign");
	
	
	Сертификат.Вставить("certificate",СтркутураСертификата);
	
	
	
	
	
	ЗаписьJSON.УстановитьСтроку(ПараметрыДжсон);
	
	ЗаписатьJSON(ЗаписьJSON, Сертификат, Новый НастройкиСериализацииJSON);
	
	СтрJSON = ЗаписьJSON.Закрыть();
	ЗаписатьДанныеВФайл(ТекстовыйФайл,ИмяФайлаВыгрузки,СтрJSON);
	ЗаписатьДанныеВФайл(ТекстовыйФайл,ИмяФайлаВыгрузки,Разделитель);
	
	
	СоздатьФайлФлаг(9999);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Добавление_В_КС(Команда)
	
	Добавление_В_КСНаСервере();
КонецПроцедуры


Процедура ЗаписатьШапку(ИмяФайлаВыгрузки)
	
	Текст = "### data begin ###";
	
	Буфер = ПолучитьБуферДвоичныхДанныхИзСтроки(Текст);
	ФП = Новый ФайловыйПоток(ИмяФайлаВыгрузки, РежимОткрытияФайла.Дописать);
	ФП.Перейти(1, ПозицияВПотоке.Начало);
	ФП.Записать(Буфер ,0, Буфер.Размер);
	ФП.Закрыть();
	
КонецПроцедуры

Процедура ЗаписатьДанныеВФайл(ТекстовыйФайл,ИмяФайлаВыгрузки,СтрокаСДанными)
	//Текст = СтрокаСДанными;
	
	
	
	ТекстовыйФайл.ДобавитьСтроку(СтрокаСДанными);
	ТекстовыйФайл.Записать(
	ИмяФайлаВыгрузки, // путь для сохранения
	КодировкаТекста.UTF8, // кодировка
	//Символы.ВК // разделитель строк
	);
	
	//Буфер = ПолучитьБуферДвоичныхДанныхИзСтроки(Текст);
	//ФП = Новый ФайловыйПоток(ИмяФайлаВыгрузки, РежимОткрытияФайла.Дописать);
	//ФП.Перейти(1, ПозицияВПотоке.Текущая);
	//ФП.Записать(ПолучитьСтрокуИзБуфераДвоичныхДанных(Буфер) ,0, Буфер.Размер);
	//ФП.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.СписокКомманд = Новый Структура;
	
	// Товары
	// Весы
	Объект.СписокКомманд.Вставить("Сертификаты", "addCertificate");
	
КонецПроцедуры

Процедура ЗаписатьКомманду(ТекстовыйФайл,Комманда,ИмяФайла,ЗаписьJSON,ПараметрыДжсон,Разделитель)

	
	 Данные = Новый Структура;
	 Данные.Вставить("command", Комманда);

	 
	 ЗаписьJSON.УстановитьСтроку(ПараметрыДжсон);
		
		ЗаписатьJSON(ЗаписьJSON, Данные, Новый НастройкиСериализацииJSON);
		
		СтрJSON = ЗаписьJSON.Закрыть();
		ЗаписатьДанныеВФайл(ТекстовыйФайл,ИмяФайла,СтрJSON);
		ЗаписатьДанныеВФайл(ТекстовыйФайл,ИмяФайла,Разделитель);
	
КонецПроцедуры	

Процедура СоздатьФайлФлаг(НомерМагазина)
	

	ИмяФайлаВыгрузки =  "H:\Пашков\Задачи\Обмен с Artix\ChahgArtix\All.flz"; 

	
	
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	ТекстовыйФайл.Записать(
	ИмяФайлаВыгрузки // путь для сохранения
	//	КодировкаТекста.UTF8, // кодировка
	//Символы.ВК // разделитель строк
	);
	
	
	
КонецПроцедуры	

